Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/index.html.txt.tmx
Source language: en
Languages: ga

source: The asylum process in Ireland
ga: An próiseas tearmainn in Éirinn

source: Overview Document International protection – an overview This document describes the process for seeking international protection in Ireland and services for refugees in Ireland
ga: Overview Document Cosaint idirnáisiúnta - achoimre Cur síos an doiciméad seo ar phróiséas iarrtha ar chosaint idirnáisiúnta in Éirinn agus seirbhísí do dhídeanaithe in Éirinn

source: Coming to Ireland as an asylum seeker or refugee
ga: Ag teacht go hÉirinn mar iarrthóir tearmainn nó mar dhídeanaí

source: This document explains some of the terms used in the international protection process: asylum seekers, Convention and Programme refugees, subsidiary protection and permission to remain
ga: Tugtar cur síos ar na hiarrthóirí tearmainn, na dídeanaithe Coinbhinsiúin agus Cláir, agus na ndaoine a fuair cead fanacht in Éirinn

source: Applying for international protection in Ireland
ga: Ag cur isteach ar stádas dídeanaithe

source: Rules and processes involved in applying for international protection in Ireland
ga: Tá rialacha agus próisis tábhachtacha éagsúla ann a bhaineann le hiarratas a chur isteach ar stádas dídeanaí in Éirinn

source: Rights and obligations of asylum seekers in Ireland
ga: Cearta agus oibleagáidí na niarrthóirí tearmainn

source: People applying for international protection in Ireland have certain legal rights
ga: Tá cearta dlíthiúla áirithe ag iarrthóirí tearmainn agus acu siúd a chuireann iarratas isteach ar dhearbhú dídeanaí in Éirinn

source: They also have important obligations
ga: Tá oibleagáidí tábhachtacha orthu freisin

source: Find out about these rights and obligations
ga: Faigh eolas maidir leis na cearta agus na hoibleagáidí seo

source: If you do not get a declaration as a refugee
ga: Má dhiúltaítear do d'iarratas ar stádas dídeanaí

source: This document describes the appeals process in the event that you do not get a declaration as a refugee
ga: Tugann an doiciméad seo cur síos ar an bpróiseas achomhairc sa chás go ndiúltófar do d’iarratas ar stádas dídeanaí

source: Withdrawing from the international protection process
ga: Ag aistarraingt ón bpróiseas tearmainn

source: This document describes the procedures you should follow if you are withdrawing your application for international protection or your appeal in the event of refusal of international protection
ga: Tugann an doiciméad seo cur síos ar na nósanna imeachta ar chóir duit a leanúint má tá tú chun d’iarratas nó d’achomhrac ar stádas dídeanaí a tharraingt siar sa chás gur diúltaíodh do stádas dídeanaí

source: The Eurodac system was established by the European Union for the comparison of fingerprints of asylum applicants and illegal immigrants
ga: Bhunaigh an tAontas Eorpach an córas Eurodac chun méarloirg na n-iarrthóirí tearmainn a chur i gcomparáid le méarloirg na n-inimirceach neamhdhleathach

source: The Dublin III Regulation provides a mechanism for determining which country is responsible for examining an application for international protection
ga: Tugann an doiciméad seo achoimre ar Rialacháin Bhaile Átha Cliath, a sholáthraíonn meicníocht chun socrú na tíre atá freagrach as iarratas ar chosaint idirnáisiúnta a scrúdú

source: Assessment and examination of applications for international protection in Ireland
ga: Fiosrú na niarratas ag Coimisinéir Iarratais do Dhídeanaithe

source: An outline of how applications for international protection in Ireland are assessed and examined
ga: Tugtar achoimre ar an bpróiseas agallaimh d’iarrthóirí tearmainn i mbun lorg an stádais dídeanaí in Éirinn

source: Decisions made by the Minister for Justice and Equality in relation to international protection
ga: Cinntí a dhéanann an tAire Dlí agus Cirt agus Comhionnanais maidir le cosaint idirnáisiúnta

source: This document describes the role of the Minister for Justice and Equality in the granting of international protection (refugee status or subsidiary protection) and the legal rights of someone granted internation protection
ga: Cuireann an doiciméad seo síos ar ról an Aire Dlí, Cirt agus Comhionnanais i mbronnadh na cosanta idirnáisiúnta (stádas teifigh nó cosaint thánaisteach) agus na cearta dlíthiúla atá ag duine ar a mbronnadh cosaint idirnáisiúnta

source: Most Read in "Moving Country"
ga: Ábhar is mó éilimh i "Ag bogadh tíre"

source: Irish citizenship through birth or descent
ga: Saoránacht d'Éirinn ó bhreith nó ó ghinealach

source: Visa requirements for entering Ireland
ga: Riachtanais víosa le teacht isteach in Éirinn

source: Coming to work in Ireland
ga: Ag teacht go hÉirinn chun oibriú

source: Becoming an Irish citizen
ga: Ag éirí i do shaoránach Éireannach
